Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, 344, 16)           160016    
_________________________________________________________________
gru_1 (GRU)                  (None, 88)                27984     
_________________________________________________________________
dense_1 (Dense)              (None, 5)                 445       
=================================================================
Total params: 188,445
Trainable params: 188,445
Non-trainable params: 0
_________________________________________________________________
