Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, 344, 32)           320032    
_________________________________________________________________
dropout_2 (Dropout)          (None, 344, 32)           0         
_________________________________________________________________
simple_rnn_1 (SimpleRNN)     (None, 72)                7560      
_________________________________________________________________
dropout_3 (Dropout)          (None, 72)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 5)                 365       
=================================================================
Total params: 327,957
Trainable params: 327,957
Non-trainable params: 0
_________________________________________________________________
