Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, 344, 32)           320032    
_________________________________________________________________
bidirectional_1 (Bidirection (None, 144)               45792     
_________________________________________________________________
dense_1 (Dense)              (None, 5)                 725       
=================================================================
Total params: 366,549
Trainable params: 366,549
Non-trainable params: 0
_________________________________________________________________
