Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_5 (Dense)              (None, 384)               132480    
_________________________________________________________________
dropout_4 (Dropout)          (None, 384)               0         
_________________________________________________________________
dense_6 (Dense)              (None, 320)               123200    
_________________________________________________________________
dropout_5 (Dropout)          (None, 320)               0         
_________________________________________________________________
dense_7 (Dense)              (None, 256)               82176     
_________________________________________________________________
dropout_6 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_8 (Dense)              (None, 112)               28784     
_________________________________________________________________
dropout_7 (Dropout)          (None, 112)               0         
_________________________________________________________________
dense_9 (Dense)              (None, 5)                 565       
=================================================================
Total params: 367,205
Trainable params: 367,205
Non-trainable params: 0
_________________________________________________________________
