Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, 344, 16)           160016    
_________________________________________________________________
dropout_2 (Dropout)          (None, 344, 16)           0         
_________________________________________________________________
bidirectional_1 (Bidirection (None, 288)               46368     
_________________________________________________________________
dropout_3 (Dropout)          (None, 288)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 5)                 1445      
=================================================================
Total params: 207,829
Trainable params: 207,829
Non-trainable params: 0
_________________________________________________________________
