Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, 344, 8)            80008     
_________________________________________________________________
lstm_1 (LSTM)                (None, 96)                40320     
_________________________________________________________________
dense_1 (Dense)              (None, 5)                 485       
=================================================================
Total params: 120,813
Trainable params: 120,813
Non-trainable params: 0
_________________________________________________________________
